espressif/esp-idf/examples/peripherals/usb/tusb_sample_webusb/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s2"
CONFIG_USB_ENABLED=y
CONFIG_USB_DESC_USE_ESPRESSIF_VID=n
CONFIG_USB_DESC_CUSTOM_VID=0xcafe
CONFIG_USB_DESC_USE_DEFAULT_PID=n
CONFIG_USB_DESC_CUSTOM_PID=0x3000
CONFIG_USB_CDC_ENABLED=y
CONFIG_USB_VENDOR_ENABLED=y